# Import thư viện

In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import LabelEncoder, StandardScaler

# Xử lý Data

In [5]:
titanic=pd.read_csv("/Users/macbookpro/Documents/GitHub/Machine-Learning/data/titanic.csv")
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
titanic.drop(['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'],axis='columns', inplace=True)
titanic.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [7]:
Y=titanic.Survived
X=titanic.drop(['Survived'], axis='columns')

In [8]:
label_encoder=LabelEncoder()
X['Sex']= label_encoder.fit_transform(X['Sex'])
X.head()

   Pclass  Sex   Age     Fare
0       3    1  22.0   7.2500
1       1    0  38.0  71.2833
2       3    0  26.0   7.9250
3       1    0  35.0  53.1000
4       3    1  35.0   8.0500

In [9]:
X.columns[X.isna().any()]

Index(['Age'], dtype='object')

In [13]:
X.Age=X.Age.fillna(X.Age.median())
X.head()

   Pclass  Sex   Age     Fare
0       3    1  22.0   7.2500
1       1    0  38.0  71.2833
2       3    0  26.0   7.9250
3       1    0  35.0  53.1000
4       3    1  35.0   8.0500

In [21]:
X_train, X_test, Y_train, Y_test=train_test_split(X,Y, test_size=0.2, random_state=42)
print(len(X_train))
len(X_test)

712

179

# Built Naive Bayes model

## Dùng thư viện

In [24]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()
model.fit(X_train, Y_train)
model.score(X_test, Y_test)

0.7597765363128491

In [26]:
X_test[:10]

     Pclass  Sex   Age     Fare
709       3    1  28.0  15.2458
439       2    1  31.0  10.5000
840       3    1  20.0   7.9250
720       2    0   6.0  33.0000
39        3    0  14.0  11.2417
290       1    0  26.0  78.8500
300       3    0  28.0   7.7500
333       3    1  16.0  18.0000
208       3    0  16.0   7.7500
136       1    0  19.0  26.2833

In [28]:
Y_test[:10]

709    1
439    0
840    0
720    1
39     1
290    1
300    1
333    0
208    1
136    1
Name: Survived, dtype: int64

In [32]:
model.predict(X_test[:10])

array([0, 0, 0, 1, 1, 1, 1, 0, 1, 1])